SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/XUJQVYUO1L/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1538387497366!1199756!65537</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-01-18T18:30" ArrivalDateTime="2019-01-19T23:59" FlightNumber="233" NumberInParty="1" ResBookDesigCode="W" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="9W" FlightNumber="233"/>      <OperatingAirline Code="9W"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-01-31T02:25" ArrivalDateTime="2019-01-31T14:30" FlightNumber="234" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="333"/>      <MarketingAirline Code="9W" FlightNumber="234"/>      <OperatingAirline Code="9W"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>